; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	infrared3 - mode
	infrared0 - mode
	thermograph1 - mode
	thermograph4 - mode
	image5 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument1 image5)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph4)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star4)
	(supports instrument4 image5)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument5 infrared3)
	(supports instrument5 image5)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star4)
	(supports instrument6 infrared0)
	(supports instrument6 image5)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon7)
	(supports instrument7 spectrograph2)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 thermograph1)
	(supports instrument8 thermograph4)
	(supports instrument8 image5)
	(calibration_target instrument8 Star4)
	(supports instrument9 spectrograph2)
	(supports instrument9 thermograph4)
	(calibration_target instrument9 Star4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon6)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(pointing satellite2 Phenomenon5)
	(have_image Phenomenon5 spectrograph2)
	(have_image Phenomenon6 thermograph1)
	(have_image Phenomenon6 image5)
	(have_image Phenomenon7 thermograph1)
	(have_image Phenomenon7 infrared3)
	(have_image Phenomenon8 image5)
	(have_image Phenomenon8 infrared3)
	(have_image Planet9 thermograph1)
	(have_image Planet10 infrared3)
))

)

; plan
1. (turn_to satellite3 star4 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star4)
   goals met: 0 of 11
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 11
3. (calibrate satellite3 instrument5 star4)
   added: (calibrated instrument5)
   goals met: 0 of 11
4. (turn_to satellite3 planet10 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 planet10)
   goals met: 0 of 11
5. (take_image satellite3 planet10 instrument5 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 1 of 11
6. (turn_to satellite3 phenomenon6 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon6)
   goals met: 1 of 11
7. (turn_to satellite2 groundstation1 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 groundstation1)
   goals met: 1 of 11
8. (turn_to satellite0 phenomenon7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 11
9. (take_image satellite3 phenomenon6 instrument5 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 3 of 11
10. (take_image satellite3 phenomenon6 instrument5 image5)
   added: (have_image phenomenon6 image5)
   goals met: 4 of 11
11. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 4 of 11
12. (calibrate satellite2 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 4 of 11
13. (turn_to satellite2 phenomenon5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon5)
   goals met: 5 of 11
14. (take_image satellite2 phenomenon5 instrument2 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 6 of 11
15. (turn_to satellite3 phenomenon7 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 phenomenon7)
   goals met: 6 of 11
16. (take_image satellite3 phenomenon7 instrument5 infrared3)
   added: (have_image phenomenon7 infrared3)
   goals met: 7 of 11
17. (take_image satellite3 phenomenon7 instrument5 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 8 of 11
18. (turn_to satellite3 phenomenon8 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 phenomenon8)
   goals met: 8 of 11
19. (take_image satellite3 phenomenon8 instrument5 image5)
   added: (have_image phenomenon8 image5)
   goals met: 9 of 11
20. (take_image satellite3 phenomenon8 instrument5 infrared3)
   added: (have_image phenomenon8 infrared3)
   goals met: 10 of 11
21. (turn_to satellite3 planet9 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet9)
   goals met: 10 of 11
22. (take_image satellite3 planet9 instrument5 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 11 of 11
